resume.tex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{fullpage}
\usepackage[T1]{fontenc}
\usepackage[scaled]{helvet}
\renewcommand*\familydefault{\sfdefault}}
\providecommand{\alert}[1]{\textbf{#1}}

\title{}
%\author{}
\date{}
\hypersetup{
  pdfkeywords={},
  pdfsubject={Brian Peck's Resume},
  pdfcreator={Emacs Org-mode version 7.9.3f}}

\begin{document}




\begin{center}
{\huge Brian Peck} \\
1200 E Hillsdale Blvd \#209 | Foster City, CA | 619-800-8774 | brian.andrew.peck@gmail.com
\hrule
\end{center}

\section*{Experience}
\label{sec-1}
\subsection*{Software Engineer, Apartment List, 2014}
\label{sec-1-1}
\subsubsection*{Apartment List Android Application}
\label{sec-1-1-1}

\begin{itemize}
\item Designed and developed the native Android OS application for Apartment List. Responsible for high visibility consumer facing features, and managing of user-data stored on the device and its synchronization with server side APIs.
\end{itemize}
\subsection*{Software Engineer, Intel, 2012 - 2014}
\label{sec-1-2}
\subsubsection*{Ingestion and Management of data from external sources to front end data systems}
\label{sec-1-2-1}

\begin{itemize}
\item Designed and developed Scala-based system for loading, and managing external provider data. Worked from initial prototype stages to production ready system on the ability to ingest, curate, and serve specific data to front end consumers.
\end{itemize}
\subsection*{Software Engineer, Lockheed Martin Advanced Technologies, 2007 - 2012}
\label{sec-1-3}
\subsubsection*{Systems Biology Simulation Framework}
\label{sec-1-3-1}

\begin{itemize}
\item Lead developer of a Scala-based network modeling framework for the National Institutes of Health (NIH). Responsible for the development and maintenance of algorithms and user interfaces allowing biologists to model genetic reactions. Framework allows run-time compilation of user-built networks through the user of ScalaScriptEngine.
\end{itemize}
\subsubsection*{Distributed Event Log Aggregator}
\label{sec-1-3-2}

\begin{itemize}
\item Lead developer of a Java-based, security log aggregation and auditing tool for use across secure networks which enables the remote locating, querying, and processing of logs for auditing, including client and server-side filtering capabilities. Integrated with OS independent tools to allow for use on networks with current and legacy systems.
\end{itemize}
\subsubsection*{RESTful Web Services allowing Command and Control for Office of Naval Research}
\label{sec-1-3-3}

\begin{itemize}
\item Developed web applications and RESTful services for Navy Command and Control (C2) capabilities, used in weekly planning and organizational briefings to Navy Admirals. Created command relationship tool and additional web services providing XML and JSON data to other C2 applications.
\end{itemize}
\subsubsection*{Augmented Reality Prototyping for DARPA ULTRA-Vis}
\label{sec-1-3-4}

\begin{itemize}
\item Developed prototype of a wearable, P2P, augmented reality system to enhance the warfighter's situational awareness. Developed P2P communication systems and integrated a head-mounted display with cameras creating a 3D model of the current viewable area and directional sensors from five partners to allow functionality in and out of GPS challenged environments. Successful field demonstration to DARPA personnel in January 2010.
\end{itemize}
\subsection*{Web Development Intern, USGS Astrogeology, 2006 - 2007}
\label{sec-1-4}

\begin{itemize}
\item Developed and maintained websites for the USGS Astrogeology Department using JavaScript, HTML, and Perl. Updated and expanded content, and improved user experience for existing NASA imagery viewer available at \href{http://www.mapaplanet.org}{http://www.mapaplanet.org}. Integrated Perl scripts with GIS enabled databases to provide on-demand content to users.
\end{itemize}
\section*{Technical Expertise}
\label{sec-2}
\subsection*{Languages}
\label{sec-2-1}

\begin{itemize}
\item Proficient in Java and Scala
\item Significant experience in JavaScript, HTML, and CSS
\item Familiar with Python
\end{itemize}
\subsection*{Tools}
\label{sec-2-2}

\begin{itemize}
\item Git, Mecrurial, SBT, Gradle, Ant, Elastic Search, MongoDB, Neo4j, Eclipse, Intellij
\item Object Oriented Programming, REST API Design
\end{itemize}
\section*{Awards}
\label{sec-3}

\begin{itemize}
\item 2011: Lockheed Martin Spot Award for exceeding project expectations on security log aggregation tool.
\item 2010: Lockheed Martin Spot Award for recognition of customer praise in creating C2 organizational tool, and technical support.
\item 2008: Lockheed Martin Spot Award for demonstrating exceptional performance developing web enabled track fusion capabilities.
\end{itemize}
\section*{Education}
\label{sec-4}

\begin{itemize}
\item \emph{Master of Science in Computer Science}, University Southern California 2014 (expected)
\item \emph{Bachelor of Science in Computer Science}, Northern Arizona University 2007
\end{itemize}

\end{document}
